Ran Plan for 5 projects:

1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
1. dir: `management/global/cost-report` workspace: `default`
1. dir: `management/global/organizations` workspace: `default`
1. dir: `management/global/sso` workspace: `default`
1. dir: `shared/us-east-1/secrets-manager` workspace: `default`
---

### 1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:28:29.775] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:28:29.785] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.shared_vpc: Reading...
data.terraform_remote_state.shared_vpc: Read complete after 0s
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s
data.aws_secretsmanager_secret_version.auth_token: Reading...
data.aws_secretsmanager_secret_version.auth_token: Read complete after 0s [id=/devops/apps-devstg/elasticache-redis/auth_token|AWSCURRENT]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.elasticache_redis.aws_elasticache_parameter_group.default[0] will be created
  + resource "aws_elasticache_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Elasticache parameter group bb-apps-devstg-redis-redis7"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "bb-apps-devstg-redis-redis7"
      + tags        = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all    = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }

      + parameter {
          + name  = "notify-keyspace-events"
          + value = "lK"
        }
    }

  # module.elasticache_redis.aws_elasticache_replication_group.default[0] will be created
  + resource "aws_elasticache_replication_group" "default" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token                     = (sensitive value)
      + auth_token_update_strategy     = "SET"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = false
      + description                    = "bb-apps-devstg-redis"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = "wed:03:00-wed:04:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = "ipv4"
      + node_type                      = "cache.t3.small"
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "bb-apps-devstg-redis-redis7"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "us-east-1a",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "bb-apps-devstg-redis"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 0
      + snapshot_window                = "06:30-07:30"
      + subnet_group_name              = "bb-apps-devstg-redis"
      + tags                           = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all                       = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + transit_encryption_enabled     = true
      + transit_encryption_mode        = (known after apply)
    }

  # module.elasticache_redis.aws_elasticache_subnet_group.default[0] will be created
  + resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Elasticache subnet group for bb-apps-devstg-redis"
      + id          = (known after apply)
      + name        = "bb-apps-devstg-redis"
      + subnet_ids  = [
          + "subnet-05d75d908f61d35e5",
          + "subnet-094c287defbc07180",
          + "subnet-0cec521de70ee76a3",
        ]
      + tags        = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all    = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + vpc_id      = (known after apply)
    }

  # module.elasticache_redis.module.aws_security_group.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Security group for Elasticache Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all               = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-072f329fed6757e95"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.elasticache_redis.module.aws_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.elasticache_redis.module.aws_security_group.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode({})
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint = (known after apply)
  + port     = 6379



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d apps-devstg/us-east-1/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fapps-devstg%252Fus-east-1%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d apps-devstg/us-east-1/elasticache-redis
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
### 2. dir: `management/global/cost-report` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:28:47.090] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:28:47.101] INFO     ✔ OK                                                    
                                                                                
module.cost_report.data.external.archive_prepare[0]: Reading...
module.cost_report.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cost_report.local_file.archive_plan[0]: Refreshing state... [id=ce6c30b27e569cdb210c9f3962a65c7b3c63b4ea]
module.cost_report.null_resource.archive[0]: Refreshing state... [id=9092462144910318072]
aws_cloudwatch_event_rule.lambda_schedule: Refreshing state... [id=bb-root-cost-report-helper-daily]
module.cost_report.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/bb-root-cost-report]
module.cost_report.data.aws_partition.current: Reading...
module.cost_report.data.aws_region.current: Reading...
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cost_report.data.aws_caller_identity.current: Reading...
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cost_report.data.aws_partition.current: Read complete after 0s [id=aws]
module.cost_report.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cost_report.aws_iam_role.lambda[0]: Refreshing state... [id=bb-root-cost-report]
module.cost_report.data.aws_caller_identity.current: Read complete after 0s [id=754065527950]
module.cost_report.data.aws_iam_policy_document.logs[0]: Reading...
module.cost_report.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1316491389]
module.cost_report.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-0]
module.cost_report.aws_iam_role_policy.logs[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-logs]
module.cost_report.aws_lambda_function.this[0]: Refreshing state... [id=bb-root-cost-report]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=bb-root-cost-report-helper-daily-SendToLambda]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d management/global/cost-report
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fmanagement%252Fglobal%252Fcost-report%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d management/global/cost-report
  ```
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `management/global/organizations` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:29:05.104] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:29:05.119] INFO     ✔ OK                                                    
                                                                                
null_resource.ram_enable_sharing_with_aws_organization: Refreshing state... [id=6822314433140342934]
data.aws_iam_roles.apps-prd: Reading...
data.aws_iam_roles.network: Reading...
aws_organizations_policy.delete_protection: Refreshing state... [id=p-m6li7ssz]
data.aws_iam_roles.shared: Reading...
aws_iam_service_linked_role.linked_roles["config.amazonaws.com"]: Refreshing state... [id=arn:aws:iam::754065527950:role/aws-service-role/config.amazonaws.com/AWSServiceRoleForConfig]
aws_iam_service_linked_role.linked_roles["access-analyzer.amazonaws.com"]: Refreshing state... [id=arn:aws:iam::754065527950:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer]
aws_organizations_organization.main: Refreshing state... [id=o-8mgimbu5mr]
aws_organizations_account.root: Refreshing state... [id=754065527950]
data.aws_iam_roles.network: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.apps-prd: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.shared: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.apps-devstg: Reading...
data.aws_iam_roles.apps-devstg: Read complete after 0s [id=us-east-1]
aws_organizations_policy.tag_protection: Refreshing state... [id=p-7nyj6n2n]
aws_organizations_policy.standard: Refreshing state... [id=p-b85e42hx]
aws_organizations_policy.default: Refreshing state... [id=p-up97og9o]
aws_organizations_organizational_unit.units["bbl_workshop"]: Refreshing state... [id=ou-oz9d-2kap9n2s]
aws_organizations_organizational_unit.units["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji]
aws_organizations_organizational_unit.units["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj]
aws_organizations_organizational_unit.units["bbl_data_science"]: Refreshing state... [id=ou-oz9d-a5euqznv]
aws_organizations_organizational_unit.units["security"]: Refreshing state... [id=ou-oz9d-0r3x4pz3]
aws_organizations_organizational_unit.units["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er]
aws_organizations_organizational_unit.units["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz]
aws_organizations_policy_attachment.delete_protection["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-m6li7ssz]
aws_organizations_policy_attachment.policy_attachments["security"]: Refreshing state... [id=ou-oz9d-0r3x4pz3:p-up97og9o]
aws_organizations_policy_attachment.delete_protection["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-m6li7ssz]
aws_organizations_account.accounts["workshop-genai-1"]: Refreshing state... [id=212088700810]
aws_organizations_policy_attachment.tag_protection["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-7nyj6n2n]
aws_organizations_policy_attachment.delete_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-m6li7ssz]
aws_organizations_policy_attachment.tag_protection["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-7nyj6n2n]
aws_organizations_policy_attachment.delete_protection["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-m6li7ssz]
aws_organizations_policy_attachment.tag_protection["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-7nyj6n2n]
aws_organizations_policy_attachment.policy_attachments["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-up97og9o]
aws_organizations_policy_attachment.policy_attachments["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_data_science"]: Refreshing state... [id=ou-oz9d-a5euqznv:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_workshop"]: Refreshing state... [id=ou-oz9d-2kap9n2s:p-b85e42hx]
aws_organizations_account.accounts["workshop-genai-2"]: Refreshing state... [id=571170910595]
aws_organizations_policy_attachment.tag_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-7nyj6n2n]
aws_organizations_account.accounts["workshop-genai-3"]: Refreshing state... [id=094271238832]
aws_organizations_account.accounts["data-science"]: Refreshing state... [id=905418344519]
aws_organizations_account.accounts["shared"]: Refreshing state... [id=763606934258]
aws_organizations_account.accounts["apps-devstg"]: Refreshing state... [id=523857393444]
aws_organizations_account.accounts["network"]: Refreshing state... [id=822280187662]
aws_organizations_account.accounts["apps-prd"]: Refreshing state... [id=802787198489]
aws_organizations_account.accounts["security"]: Refreshing state... [id=900980591242]
aws_cloudtrail_organization_delegated_admin_account.main: Refreshing state... [id=900980591242]
aws_organizations_delegated_administrator.delegated_administrator["access-analyzer.amazonaws.com"]: Refreshing state... [id=900980591242/access-analyzer.amazonaws.com]
aws_organizations_delegated_administrator.delegated_administrator["config.amazonaws.com"]: Refreshing state... [id=900980591242/config.amazonaws.com]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d management/global/organizations
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fmanagement%252Fglobal%252Forganizations%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d management/global/organizations
  ```
No changes. Your infrastructure matches the configuration.

---
### 4. dir: `management/global/sso` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'leverage tf plan -input=false -refresh -out="$REAL_PLANFILE"' in '/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso': exit status 1: running "leverage tf plan -input=false -refresh -out=\"$REAL_PLANFILE\"" in "/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso": 
[15:29:26.505] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:29:26.516] INFO     ✔ OK                                                    
                                                                                
module.account_assignments.null_resource.dependency: Refreshing state... [id=3572017111657332447]
module.permission_sets.data.aws_ssoadmin_instances.this: Reading...
data.aws_iam_policy_document.marketplaceseller: Reading...
data.aws_iam_policy_document.data_scientist: Reading...
data.aws_ssoadmin_instances.main: Reading...
data.aws_iam_policy_document.github_automation: Reading...
data.aws_iam_policy_document.marketplaceseller: Read complete after 0s [id=216798746]
data.aws_iam_policy_document.devops: Reading...
module.account_assignments.data.aws_ssoadmin_instances.this: Reading...
data.aws_iam_policy_document.github_automation: Read complete after 0s [id=1914219528]
data.aws_iam_policy_document.data_scientist: Read complete after 1s [id=1102031294]
data.aws_iam_policy_document.devops: Read complete after 1s [id=3868196803]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: 0763614b-5794-4c7b-b48c-52394f9a3af2, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754666972367915850 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with data.aws_ssoadmin_instances.main,
│   on config.tf line 27, in data "aws_ssoadmin_instances" "main":
│   27: data "aws_ssoadmin_instances" "main" {}
│ 
╵
╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: 4d9a00b1-a4f3-4e1f-a975-853144ed65db, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754666972367915850 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with module.account_assignments.data.aws_ssoadmin_instances.this,
│   on .terraform/modules/account_assignments/modules/account-assignments/main.tf line 60, in data "aws_ssoadmin_instances" "this":
│   60: data "aws_ssoadmin_instances" "this" {}
│ 
╵
╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: 8084204f-3f80-4587-bfd2-86a4cbd39721, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754666972367915850 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with module.permission_sets.data.aws_ssoadmin_instances.this,
│   on .terraform/modules/permission_sets/modules/permission-sets/main.tf line 50, in data "aws_ssoadmin_instances" "this":
│   50: data "aws_ssoadmin_instances" "this" {}
│ 
╵


```
</details>

---
### 5. dir: `shared/us-east-1/secrets-manager` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:29:38.782] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:29:38.793] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.keys: Reading...
data.terraform_remote_state.keys: Read complete after 0s
module.secrets.aws_secretsmanager_secret.sm["/notifications/argocd"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p]
module.secrets.aws_secretsmanager_secret.sm["/notifications/slack/cost-reports"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/phone/notifications"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa]
module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/grafana/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J]
module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/alertmanager"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK]
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-mysql/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/security"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0]
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/elasticache-redis/auth_token"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/monitoring"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2]
module.secrets.aws_secretsmanager_secret.sm["/repositories/le-demo-apps/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko]
module.secrets.aws_secretsmanager_secret.sm["/repositories/demo-google-microservices/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa]
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-aurora/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1]
module.secrets.aws_secretsmanager_secret.sm["/devops/shared/atlantis"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs]
data.aws_iam_policy_document.secrets_policy: Reading...
data.aws_iam_policy_document.secrets_policy: Read complete after 0s [id=2203052713]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/apps-devstg/database-aurora/administrator"]: Refreshing state... [id=/devops/apps-devstg/database-aurora/administrator|2FFEC0AC-DEE4-4D02-B309-02182AC1555A]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/notifications/argocd"]: Refreshing state... [id=/notifications/argocd|312BA4C3-7535-4015-A4E4-F749E9FA5224]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/notifications/slack/cost-reports"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2|13B06478-155F-4B79-9E5D-EB02813BDB3B]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/apps-devstg/database-mysql/administrator"]: Refreshing state... [id=/devops/apps-devstg/database-mysql/administrator|EEE8A08F-C19C-4C7B-ADA6-A673EFB5A2E3]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/repositories/demo-google-microservices/deploy_key"]: Refreshing state... [id=/repositories/demo-google-microservices/deploy_key|B9B6098F-C654-45F1-91CA-59FC40FCB0DA]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/repositories/le-demo-apps/deploy_key"]: Refreshing state... [id=/repositories/le-demo-apps/deploy_key|B875E39B-84D8-47E4-A5AF-232420EBF271]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/monitoring/alertmanager"]: Refreshing state... [id=/devops/monitoring/alertmanager|7E520EC8-E4C7-4080-8C04-2A0636CAE69C]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/monitoring/grafana/administrator"]: Refreshing state... [id=/devops/monitoring/grafana/administrator|8906A51B-E27F-471B-8C21-16DEA0A01E40]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/shared/atlantis"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs|1B6F6A79-0697-4FC3-AABA-0D98574D574B]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/notifications/slack/security"]: Refreshing state... [id=/devops/notifications/slack/security|EEFC5D84-0FF4-4857-8555-42CA65B9CF13]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/notifications/slack/monitoring"]: Refreshing state... [id=/devops/notifications/slack/monitoring|3618873D-F9BA-419F-BA34-B1D58EB540E1]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/notifications/phone/notifications"]: Refreshing state... [id=/devops/notifications/phone/notifications|12D4B414-DCB6-403D-B393-78C7FBF7BB01]
data.aws_iam_policy_document.merged_secret_policy["/devops/monitoring/alertmanager"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/elasticache-redis/auth_token"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/repositories/le-demo-apps/deploy_key"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/phone/notifications"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/database-mysql/administrator"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/monitoring/alertmanager"]: Read complete after 0s [id=2203052713]
module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/apps-devstg/elasticache-redis/auth_token"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX|39F71030-F943-460C-BD8A-9AA9C99DCE6D]
data.aws_iam_policy_document.merged_secret_policy["/devops/monitoring/grafana/administrator"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/elasticache-redis/auth_token"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/phone/notifications"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/devops/monitoring/grafana/administrator"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/repositories/le-demo-apps/deploy_key"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/database-mysql/administrator"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/notifications/slack/cost-reports"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/repositories/demo-google-microservices/deploy_key"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/slack/security"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/repositories/demo-google-microservices/deploy_key"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/notifications/slack/cost-reports"]: Read complete after 0s [id=2275872155]
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/database-aurora/administrator"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/notifications/argocd"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/slack/monitoring"]: Reading...
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/slack/security"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/notifications/argocd"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/devops/apps-devstg/database-aurora/administrator"]: Read complete after 0s [id=2203052713]
data.aws_iam_policy_document.merged_secret_policy["/devops/notifications/slack/monitoring"]: Read complete after 0s [id=2203052713]
aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/slack/security"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0]
aws_secretsmanager_secret_policy.secrets_policy["/devops/monitoring/grafana/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J]
aws_secretsmanager_secret_policy.secrets_policy["/notifications/slack/cost-reports"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2]
aws_secretsmanager_secret_policy.secrets_policy["/repositories/le-demo-apps/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko]
aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/slack/monitoring"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2]
aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/database-aurora/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1]
aws_secretsmanager_secret_policy.secrets_policy["/devops/shared/atlantis"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs]
aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/phone/notifications"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa]
aws_secretsmanager_secret_policy.secrets_policy["/notifications/argocd"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p]
aws_secretsmanager_secret_policy.secrets_policy["/repositories/demo-google-microservices/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa]
aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/elasticache-redis/auth_token"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX]
aws_secretsmanager_secret_policy.secrets_policy["/devops/monitoring/alertmanager"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK]
aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/database-mysql/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

OpenTofu will perform the following actions:

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/database-aurora/administrator"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/database-mysql/administrator"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/apps-devstg/elasticache-redis/auth_token"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/monitoring/alertmanager"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/monitoring/grafana/administrator"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/phone/notifications"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/slack/monitoring"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/notifications/slack/security"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/devops/shared/atlantis"] will be destroyed
  # (because key ["/devops/shared/atlantis"] is not in for_each map)
  - resource "aws_secretsmanager_secret_policy" "secrets_policy" {
      - id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
      - policy     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::763606934258:root"
                        }
                      - Resource  = "*"
                      - Sid       = "ReadSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - secret_arn = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/notifications/argocd"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/notifications/slack/cost-reports"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action    = "secretsmanager:GetSecretValue"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::754065527950:role/bb-root-cost-report"
                        }
                        Resource  = "*"
                        Sid       = "CostReportsLambda"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/repositories/demo-google-microservices/deploy_key"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_policy.secrets_policy["/repositories/le-demo-apps/deploy_key"] will be updated in-place
  ~ resource "aws_secretsmanager_secret_policy" "secrets_policy" {
        id         = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko"
      ~ policy     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ] -> "secretsmanager:GetSecretValue"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::763606934258:root" -> [
                              + "arn:aws:iam::905418344519:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_a1627cef3f7399d3",
                              + "arn:aws:iam::763606934258:role/DevOps",
                              + "arn:aws:iam::523857393444:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_DevOps_229828e5923d6952",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret.sm["/devops/shared/atlantis"] will be destroyed
  # (because key ["/devops/shared/atlantis"] is not in for_each map)
  - resource "aws_secretsmanager_secret" "sm" {
      - arn                            = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
      - description                    = "Atlantis required credentials" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
      - kms_key_id                     = "cef0e7ad-2dcc-4a31-89bf-c3ea0cab5a4c" -> null
      - name                           = "/devops/shared/atlantis" -> null
      - policy                         = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::763606934258:root"
                        }
                      - Resource  = "*"
                      - Sid       = "ReadSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - recovery_window_in_days        = 7 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "Environment" = "shared"
          - "Layer"       = "secrets-manager"
          - "Terraform"   = "true"
        } -> null
      - tags_all                       = {
          - "Environment" = "shared"
          - "Layer"       = "secrets-manager"
          - "Terraform"   = "true"
        } -> null
    }

  # module.secrets.aws_secretsmanager_secret_version.sm-sv["/devops/shared/atlantis"] will be destroyed
  # (because key ["/devops/shared/atlantis"] is not in for_each map)
  - resource "aws_secretsmanager_secret_version" "sm-sv" {
      - arn            = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
      - id             = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs|1B6F6A79-0697-4FC3-AABA-0D98574D574B" -> null
      - secret_id      = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "1B6F6A79-0697-4FC3-AABA-0D98574D574B" -> null
      - version_stages = [] -> null
    }

Plan: 0 to add, 12 to change, 3 to destroy.

Changes to Outputs:
  ~ secret_arns = {
      - "/devops/shared/atlantis"                            = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs"
        # (12 unchanged attributes hidden)
    }
  ~ secret_ids  = {
      - "/devops/shared/atlantis"                            = "arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs"
        # (12 unchanged attributes hidden)
    }



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d shared/us-east-1/secrets-manager
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fshared%252Fus-east-1%252Fsecrets-manager%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d shared/us-east-1/secrets-manager
  ```
Plan: 0 to add, 12 to change, 3 to destroy.

---
### Plan Summary

5 projects, 2 with changes, 2 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```